evidence/adim-10-6/final/k6_edge_final_raw.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: evidence\adim-10-4\k6\load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 47s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 17s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 020/100 VUs, 29 complete and 0 interrupted iterations
default   [   6% ] 020/100 VUs  01.0s/17.0s

running (02.0s), 039/100 VUs, 85 complete and 0 interrupted iterations
default   [  12% ] 039/100 VUs  02.0s/17.0s

running (03.0s), 059/100 VUs, 110 complete and 0 interrupted iterations
default   [  17% ] 059/100 VUs  03.0s/17.0s

running (04.0s), 079/100 VUs, 161 complete and 0 interrupted iterations
default   [  23% ] 079/100 VUs  04.0s/17.0s

running (05.0s), 099/100 VUs, 218 complete and 0 interrupted iterations
default   [  29% ] 099/100 VUs  05.0s/17.0s

running (06.0s), 100/100 VUs, 302 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  06.0s/17.0s

running (07.0s), 100/100 VUs, 357 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  07.0s/17.0s

running (08.0s), 100/100 VUs, 414 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  08.0s/17.0s

running (09.0s), 100/100 VUs, 501 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  09.0s/17.0s

running (10.0s), 100/100 VUs, 590 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  10.0s/17.0s

running (11.0s), 100/100 VUs, 684 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  11.0s/17.0s

running (12.0s), 100/100 VUs, 729 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  12.0s/17.0s

running (13.0s), 100/100 VUs, 791 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  13.0s/17.0s

running (14.0s), 100/100 VUs, 884 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  14.0s/17.0s

running (15.0s), 100/100 VUs, 974 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  15.0s/17.0s

running (16.0s), 081/100 VUs, 1041 complete and 0 interrupted iterations
default   [  94% ] 081/100 VUs  16.0s/17.0s

running (17.0s), 018/100 VUs, 1134 complete and 0 interrupted iterations
default   [ 100% ] 018/100 VUs  17.0s/17.0s

     Ô£ô status is 200 or 401

     checks.........................: 100.00% 1152 out of 1152
     data_received..................: 161 MB  9.3 MB/s
     data_sent......................: 653 kB  38 kB/s
     http_req_blocked...............: avg=24.8ms   min=0s      med=0s       max=3.44s    p(90)=0s       p(95)=151.42ms
     http_req_connecting............: avg=13.23ms  min=0s      med=0s       max=3.1s     p(90)=0s       p(95)=47.49ms 
     http_req_duration..............: avg=529.68ms min=11.26ms med=215.51ms max=6.45s    p(90)=1.23s    p(95)=1.4s    
       { expected_response:true }...: avg=529.68ms min=11.26ms med=215.51ms max=6.45s    p(90)=1.23s    p(95)=1.4s    
   Ô£ô http_req_failed................: 0.00%   0 out of 2304
     http_req_receiving.............: avg=406.02ms min=0s      med=30.3ms   max=6.27s    p(90)=1.08s    p(95)=1.28s   
     http_req_sending...............: avg=270┬Ás    min=0s      med=0s       max=8.33ms   p(90)=643.57┬Ás p(95)=736.1┬Ás 
     http_req_tls_handshaking.......: avg=11.45ms  min=0s      med=0s       max=941.26ms p(90)=0s       p(95)=79.67ms 
     http_req_waiting...............: avg=123.38ms min=10.59ms med=106.73ms max=827.74ms p(90)=213.79ms p(95)=265.46ms
     http_reqs......................: 2304    133.080803/s
     iteration_duration.............: avg=1.2s     min=158ms   med=1.15s    max=7.05s    p(90)=1.76s    p(95)=2.16s   
     iterations.....................: 1152    66.540402/s
     vus............................: 18      min=18           max=100
     vus_max........................: 100     min=100          max=100


running (17.3s), 000/100 VUs, 1152 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 000/100 VUs  17s